postgrest/RESULTS_TPCB_LIKE.txt
# pgrbench-all-pg-instances repeat 3 pgrbench-pgbench-varied-clients -b tpcb-like > RESULTS_TPCB_LIKE.txt

Instance: m5a.large


Run: 1


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 50804
latency average = 5.908 ms
tps = 1692.568166 (including connections establishing)
tps = 1693.073378 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 55332
latency average = 27.166 ms
tps = 1840.525824 (including connections establishing)
tps = 1841.759467 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 53306
latency average = 56.515 ms
tps = 1769.448156 (including connections establishing)
tps = 1771.531708 (excluding connections establishing)

Run: 2


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 69113
latency average = 4.343 ms
tps = 2302.678547 (including connections establishing)
tps = 2303.447189 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 62808
latency average = 23.929 ms
tps = 2089.550574 (including connections establishing)
tps = 2091.125209 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 56016
latency average = 53.800 ms
tps = 1858.752893 (including connections establishing)
tps = 1861.126842 (excluding connections establishing)

Run: 3


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 71182
latency average = 4.217 ms
tps = 2371.386331 (including connections establishing)
tps = 2372.280959 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 64090
latency average = 23.455 ms
tps = 2131.756189 (including connections establishing)
tps = 2133.212782 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 57454
latency average = 52.448 ms
tps = 1906.656474 (including connections establishing)
tps = 1908.481016 (excluding connections establishing)

Instance: m5a.xlarge


Run: 1


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 65912
latency average = 4.555 ms
tps = 2195.350948 (including connections establishing)
tps = 2195.744006 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 121608
latency average = 12.364 ms
tps = 4044.002702 (including connections establishing)
tps = 4045.749746 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 117602
latency average = 25.598 ms
tps = 3906.603352 (including connections establishing)
tps = 3908.384714 (excluding connections establishing)

Run: 2


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 89685
latency average = 3.347 ms
tps = 2988.080338 (including connections establishing)
tps = 2988.686408 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 137544
latency average = 10.926 ms
tps = 4576.262185 (including connections establishing)
tps = 4578.989918 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 122069
latency average = 24.690 ms
tps = 4050.238069 (including connections establishing)
tps = 4052.709388 (excluding connections establishing)

Run: 3


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 92658
latency average = 3.240 ms
tps = 3086.158209 (including connections establishing)
tps = 3086.801073 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 137364
latency average = 10.953 ms
tps = 4565.096940 (including connections establishing)
tps = 4567.500577 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 121706
latency average = 24.746 ms
tps = 4041.124766 (including connections establishing)
tps = 4043.084705 (excluding connections establishing)

Instance: m5a.2xlarge


Run: 1


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 68582
latency average = 4.376 ms
tps = 2285.008975 (including connections establishing)
tps = 2285.304773 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 233385
latency average = 6.442 ms
tps = 7761.616060 (including connections establishing)
tps = 7762.923956 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 234305
latency average = 12.838 ms
tps = 7789.316291 (including connections establishing)
tps = 7790.826033 (excluding connections establishing)

Run: 2


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 90927
latency average = 3.301 ms
tps = 3029.354366 (including connections establishing)
tps = 3029.761556 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 244789
latency average = 6.141 ms
tps = 8141.381304 (including connections establishing)
tps = 8142.748543 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 239279
latency average = 12.572 ms
tps = 7954.264457 (including connections establishing)
tps = 7955.923099 (excluding connections establishing)

Run: 3


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 98791
latency average = 3.038 ms
tps = 3291.563558 (including connections establishing)
tps = 3291.991957 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 246365
latency average = 6.103 ms
tps = 8192.614356 (including connections establishing)
tps = 8193.993348 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 237588
latency average = 12.670 ms
tps = 7892.579503 (including connections establishing)
tps = 7894.069683 (excluding connections establishing)

Instance: m5a.4xlarge


Run: 1


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 67181
latency average = 4.466 ms
tps = 2239.172700 (including connections establishing)
tps = 2239.432344 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 290642
latency average = 5.171 ms
tps = 9669.363645 (including connections establishing)
tps = 9670.694534 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 368486
latency average = 8.157 ms
tps = 12259.640346 (including connections establishing)
tps = 12261.667466 (excluding connections establishing)

Run: 2


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 90495
latency average = 3.315 ms
tps = 3016.191995 (including connections establishing)
tps = 3016.549370 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 298660
latency average = 5.032 ms
tps = 9936.438036 (including connections establishing)
tps = 9937.792807 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 370275
latency average = 8.121 ms
tps = 12314.426241 (including connections establishing)
tps = 12316.859581 (excluding connections establishing)

Run: 3


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 94974
latency average = 3.159 ms
tps = 3165.511401 (including connections establishing)
tps = 3165.895240 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 302650
latency average = 4.963 ms
tps = 10073.808027 (including connections establishing)
tps = 10075.219898 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 366098
latency average = 8.217 ms
tps = 12170.591825 (including connections establishing)
tps = 12172.588061 (excluding connections establishing)

Instance: m5a.8xlarge


Run: 1


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 72514
latency average = 4.138 ms
tps = 2416.871571 (including connections establishing)
tps = 2417.151143 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 320056
latency average = 4.690 ms
tps = 10659.968462 (including connections establishing)
tps = 10661.422054 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 420511
latency average = 7.146 ms
tps = 13994.723943 (including connections establishing)
tps = 13997.142066 (excluding connections establishing)

Run: 2


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 114977
latency average = 2.609 ms
tps = 3832.243797 (including connections establishing)
tps = 3832.703811 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 315333
latency average = 4.760 ms
tps = 10504.478188 (including connections establishing)
tps = 10505.943923 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 418855
latency average = 7.173 ms
tps = 13942.030375 (including connections establishing)
tps = 13944.684635 (excluding connections establishing)

Run: 3


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 114213
latency average = 2.627 ms
tps = 3806.777545 (including connections establishing)
tps = 3807.252419 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 344347
latency average = 4.362 ms
tps = 11462.709855 (including connections establishing)
tps = 11464.271425 (excluding connections establishing)


transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 416538
latency average = 7.214 ms
tps = 13862.018943 (including connections establishing)
tps = 13864.583234 (excluding connections establishing)